Catalogs/МаркетинговыеКомпанииАналитикаУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>МаркетинговыеКомпанииАналитикаУчета</Name>
			<Comment>807357</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МаркетинговаяКомпания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаркетинговыеКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаОС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыОбъектовСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отбор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Отборы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МаркетинговыеКомпанииАналитикаУчета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУсловия

&НаКлиенте
Процедура УсловияГруппаОСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено 
			И ЗначениеЗаполнено(ТекущиеДанные.МаркетинговаяКомпания) Тогда
		СтандартнаяОбработка = Ложь;	
		ПараметрыОткрывамойФормы = Новый Структура("ВызовИзМК, МаркетинговаяКомпания", Истина, ТекущиеДанные.МаркетинговаяКомпания);
		ОткрытьФорму("Справочник.ГруппыОбъектовСтроительства.ФормаВыбора", ПараметрыОткрывамойФормы, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияОтборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Условия.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено 
			И ЗначениеЗаполнено(ТекущиеДанные.МаркетинговаяКомпания) 
			И ЗначениеЗаполнено(ТекущиеДанные.ГруппаОС) Тогда
		СтандартнаяОбработка = Ложь;	
		ПараметрыОткрывамойФормы = Новый Структура("ВызовИзМК, МаркетинговаяКомпания, ОбъектСтроительства", Истина, ТекущиеДанные.МаркетинговаяКомпания, ТекущиеДанные.ГруппаОС);
		ОткрытьФорму("Справочник.Отборы.ФормаВыбора", ПараметрыОткрывамойФормы, Элемент);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
